load-test/k6/results/2-min-ingestion-10-vus/insert-app_rust_axum.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 2m0s (gracefulStop: 30s)


     _rust_axum.....................: avg=2.948854 min=0.975  med=2.796  max=71.027  p(90)=3.763  p(95)=4.208 
     data_received..................: 69 MB  573 kB/s
     data_sent......................: 73 MB  608 kB/s
     http_req_blocked...............: avg=2.96µs   min=0s     med=2µs    max=2.15ms  p(90)=3µs    p(95)=4µs   
     http_req_connecting............: avg=277ns    min=0s     med=0s     max=1.15ms  p(90)=0s     p(95)=0s    
     http_req_duration..............: avg=3ms      min=1.02ms med=2.84ms max=71.12ms p(90)=3.81ms p(95)=4.26ms
       { expected_response:true }...: avg=3ms      min=1.02ms med=2.84ms max=71.12ms p(90)=3.81ms p(95)=4.26ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 376022
     http_req_receiving.............: avg=36.44µs  min=12µs   med=32µs   max=15.42ms p(90)=54µs   p(95)=65µs  
     http_req_sending...............: avg=17.04µs  min=6µs    med=15µs   max=2.06ms  p(90)=23µs   p(95)=26µs  
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s      p(90)=0s     p(95)=0s    
     http_req_waiting...............: avg=2.94ms   min=975µs  med=2.79ms max=71.02ms p(90)=3.76ms p(95)=4.2ms 
     http_reqs......................: 376022 3133.519226/s
     iteration_duration.............: avg=3.17ms   min=1.18ms med=3.02ms max=72.77ms p(90)=4ms    p(95)=4.44ms
     iterations.....................: 376022 3133.519226/s
     vus............................: 10     min=10        max=10  
     vus_max........................: 10     min=10        max=10  


running (2m00.0s), 00/10 VUs, 376022 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  2m0s